src/cf/InformationRegisters/СостоянияИнтеграцииАУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>СостоянияИнтеграцииАУСН</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияИнтеграцииАУСН</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторПриложения</Name>
					<Comment>Идентификатор приложения в сервисе АУСН</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженоБанковскихДокументов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбмена</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокирующаяОшибкаОбмена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкиОтправки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторБанков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СтатусыОповещенийАУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>СтатусыОповещенийАУСН</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеПрочитано</Name>
					<Comment>UNACKNOWLEDGED</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочитано</Name>
					<Comment>ACKNOWLEDGED</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Архивировано</Name>
					<Comment>ARCHIVED</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/УведомленияАУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>УведомленияАУСН</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОповещения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОповещенийАУСН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстВФорматеMarkdown</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстВФорматеPush</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОповещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыУведомленийАУСН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>время создания оповещения в ПП АУСН</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Comment>время последнего обновления сообщения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолученаОшибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/УведомленияОтФНСАУСНВызовСервера/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Запускает фоновое задание, которое создает сообщения системы взаимодействия от имени служебного пользователя.
//
// Параметры:
//  ПараметрыЧатов - Соответствие - см. УведомленияОтФНСАУСНКлиент.ПараметрыВсехЧатов()
//
Процедура ПоказатьОповещенияВФоне(Знач ПараметрыЧатов) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.ЗапуститьВФоне    = Истина;
	
	Для Каждого ПараметрыСоответствияЧата Из ПараметрыЧатов Цикл	
		
		ПараметрыЧата = ПараметрыСоответствияЧата.Значение;
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = СтрШаблон(
			НСтр("ru = 'Получение уведомлений АУСН от ФНС. %1'"), ПараметрыЧата.Организация);
		ПараметрыВыполнения.КлючФоновогоЗадания = ПараметрыЧата.ИдентификаторЧата;
		ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, "УведомленияОтФНСАУСН.ПоказатьОповещения", ПараметрыЧата);
		
	КонецЦикла;
	
КонецПроцедуры

// Отправляет для пользователя чата сообщение с предложением перейти к разделу "Уведомления" в "1С-Отчетность".
//
// Параметры:
//  КомуПредложить - ИдентификаторПользователяСистемыВзаимодействия - пользователь, которому будет адресовано сообщение.
//  ПараметрыЧата - Структура - см. 
//
Процедура Предложить1СОтчетность(КомуПредложить, ПараметрыЧата) Экспорт
	
	ПользовательБота = СистемаВзаимодействия.ПолучитьПользователя(
		Новый ИдентификаторПользователяСистемыВзаимодействия(ПараметрыЧата.ИдентификаторПомощника));
	
	Получатели = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Новый ИдентификаторПользователяСистемыВзаимодействия(КомуПредложить));
	
	ТекстСообщения = НСтр("ru = 'Для отправки ответных сообщений в ФНС рекомендуется использовать специализированный сервис.
                          |<a href=""ПерейтиВ1СОтчетность"">Открыть ""1С-Отчетность""</a>'");
	ОтправляемоеСообщение = Обсуждения.ОписаниеСообщения(
		СтроковыеФункции.ФорматированнаяСтрока(ТекстСообщения));
		
	ОтправляемоеСообщение.Данные = Новый Структура("Идентификатор", "ПерейтиВ1СОтчетность");
	
	ИдентификаторЧата = Новый ИдентификаторОбсужденияСистемыВзаимодействия(ПараметрыЧата.ИдентификаторЧата);
	
	Обсуждения.ОтправитьСообщение(ПользовательБота, Получатели, ОтправляемоеСообщение, ИдентификаторЧата);
	
КонецПроцедуры

// Получает ссылку на уведомление по его идентификатору.
//
// Параметры:
//  ИдентификаторУведомления - Строка - код удаляемого уведомления.
//
// Возвращаемое значение:
//   СправочникСсылка.УведомленияАУСН - объект, в котором хранится уведомление.
//
Функция УведомлениеПоИдентификатору(Знач ИдентификаторУведомления) Экспорт
	
	Возврат Справочники.УведомленияАУСН.НайтиПоКоду(ИдентификаторУведомления);
	
КонецФункции

// Удаляет сообщение системы взаимодействия и помечает уведомление от ФНС как архивированное.
//
// Параметры:
//  ИдентификаторСообщения - ИдентификаторСообщенияСистемыВзаимодействия - удаляемое сообщение.
//  ИдентификаторУведомления - Строка - код удаляемого уведомления.
//
Процедура УдалитьСообщение(Знач ИдентификаторСообщения, Знач ИдентификаторУведомления = "") Экспорт
	
	Если ПустаяСтрока(ИдентификаторУведомления) Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		СистемаВзаимодействия.УдалитьСообщение(ИдентификаторСообщения);
		УстановитьПривилегированныйРежим(Ложь);
		Возврат;
		
	КонецЕсли;
	
	УведомлениеОтФНС = Справочники.УведомленияАУСН.НайтиПоКоду(ИдентификаторУведомления);
	Если УведомлениеОтФНС.Пустая() Тогда
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Не найдено уведомление от ФНС с идентификатором (MessageId) = %1'"),
			ИдентификаторУведомления);
		
		ЗаписьЖурналаРегистрации(ИнтеграцияАУСНКлиентСервер.ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.Справочники.УведомленияАУСН,
			,
			ОписаниеОшибки());
			
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		
	Иначе
		
		Попытка
		
			УведомлениеОбъект = УведомлениеОтФНС.ПолучитьОбъект();
			Если УведомлениеОбъект.СтатусОповещения <> Перечисления.СтатусыОповещенийАУСН.Архивировано Тогда
				УведомлениеОбъект.СтатусОповещения = Перечисления.СтатусыОповещенийАУСН.Архивировано;
				УведомлениеОбъект.Записать();
			КонецЕсли;
			
		Исключение
			
			ТекстОшибки = СтрШаблон(
				НСтр("ru = 'Не удалось архивировать уведомление от ФНС для %1.
                      |Header = %2
                      |MessageId = %3
                      |%4'"),
				УведомлениеОтФНС.Организация, УведомлениеОтФНС.Наименование, УведомлениеОтФНС.Код, ОписаниеОшибки());
			
			ЗаписьЖурналаРегистрации(ИнтеграцияАУСНКлиентСервер.ИмяСобытияЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Справочники.УведомленияАУСН,
				УведомлениеОтФНС,
				ОписаниеОшибки());
				
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			
			Возврат;
			
		КонецПопытки;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	СистемаВзаимодействия.УдалитьСообщение(ИдентификаторСообщения);
	
КонецПроцедуры

Функция ЕстьНепрочитанныеУведомления() Экспорт
	
	Если Не Пользователи.РолиДоступны("ДобавлениеИзменениеДанныхБухгалтерии") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	УведомленияАУСН.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УведомленияАУСН КАК УведомленияАУСН
	|ГДЕ
	|	УведомленияАУСН.СтатусОповещения = ЗНАЧЕНИЕ(Перечисление.СтатусыОповещенийАУСН.НеПрочитано)
	|	И НЕ УведомленияАУСН.ПометкаУдаления";
	
	Результат = Запрос.Выполнить();
	Возврат Не Результат.Пустой();
	
КонецФункции

Функция МожноПодключитьОбсуждения() Экспорт
	
	Возврат ПравоДоступа("Просмотр", Метаданные.Обработки.ПодключениеАУСН)
		И ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Обсуждения");
	
КонецФункции

Функция ОбсужденияПодключены() Экспорт
	
	Если МожноПодключитьОбсуждения() Тогда
		МодульОбсуждения = ОбщегоНазначения.ОбщийМодуль("Обсуждения");
		Возврат МодульОбсуждения.ОбсужденияДоступны();
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ЛичныйКабинетБанкаДляУведомления(Идентификатор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УведомленияАУСН.ИдентификаторБанка КАК ИдентификаторБанка,
		|	УведомленияАУСН.Организация КАК Организация
		|ИЗ
		|	Справочник.УведомленияАУСН КАК УведомленияАУСН
		|ГДЕ
		|	УведомленияАУСН.Код = &Идентификатор";
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ПодключенныеБанки = РегистрыСведений.СостоянияИнтеграцииАУСН.Банки(Выборка.Организация, Выборка.ИдентификаторБанка);
		Если ПодключенныеБанки.Следующий() Тогда
			Возврат ИнтеграцияАУСНПовтИсп.СсылкаЛичныйКабинетБанка(ПодключенныеБанки.Банк);
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
